sterentev/atdf-device-asm-include/inc/ATmega8A.inc
; **********************************************************************
; ***************	LOCKBITS REGISTERS	************************
; **********************************************************************
;
.equ	LOCKBIT		= 0x00


; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	GICR		= 0x3B		; General Interrupt Control Register
.equ	GIFR		= 0x3A		; General Interrupt Flag Register
.equ	TIMSK		= 0x39		; Timer/Counter Interrupt Mask Register
.equ	TIFR		= 0x38		; Timer/Counter Interrupt Flag register
.equ	SPMCR		= 0x37		; Store Program Memory Control Register
.equ	TWCR		= 0x36		; TWI Control Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUCSR		= 0x34		; MCU Control And Status Register
.equ	TCCR0		= 0x33		; Timer/Counter0 Control Register
.equ	TCNT0		= 0x32		; Timer Counter 0
.equ	OSCCAL		= 0x31		; Oscillator Calibration Value
.equ	SFIOR		= 0x30		; Special Function IO Register
.equ	TCCR1A		= 0x2F		; Timer/Counter1 Control Register A
.equ	TCCR1B		= 0x2E		; Timer/Counter1 Control Register B
.equ	TCNT1		= 0x2C		; Timer/Counter1  Bytes
.equ	OCR1A		= 0x2A		; Timer/Counter1 Output Compare Register  Bytes
.equ	OCR1B		= 0x28		; Timer/Counter1 Output Compare Register  Bytes
.equ	ICR1		= 0x26		; Timer/Counter1 Input Capture Register  Bytes
.equ	TCCR2		= 0x25		; Timer/Counter2 Control Register
.equ	TCNT2		= 0x24		; Timer/Counter2
.equ	OCR2		= 0x23		; Timer/Counter2 Output Compare Register
.equ	ASSR		= 0x22		; Asynchronous Status Register
.equ	WDTCR		= 0x21		; Watchdog Timer Control Register
.equ	UCSRC		= 0x20		; USART Control and Status Register C
.equ	UBRRH		= 0x20		; USART Baud Rate Register High Byte
.equ	EEAR		= 0x1E		; EEPROM Address Register  Bytes
.equ	EEDR		= 0x1D		; EEPROM Data Register
.equ	EECR		= 0x1C		; EEPROM Control Register
.equ	PORTB		= 0x18		; Port B Data Register
.equ	DDRB		= 0x17		; Port B Data Direction Register
.equ	PINB		= 0x16		; Port B Input Pins
.equ	PORTC		= 0x15		; Port C Data Register
.equ	DDRC		= 0x14		; Port C Data Direction Register
.equ	PINC		= 0x13		; Port C Input Pins
.equ	PORTD		= 0x12		; Port D Data Register
.equ	DDRD		= 0x11		; Port D Data Direction Register
.equ	PIND		= 0x10		; Port D Input Pins
.equ	SPDR		= 0x0F		; SPI Data Register
.equ	SPSR		= 0x0E		; SPI Status Register
.equ	SPCR		= 0x0D		; SPI Control Register
.equ	UDR		= 0x0C		; USART I/O Data Register
.equ	UCSRA		= 0x0B		; USART Control and Status Register A
.equ	UCSRB		= 0x0A		; USART Control and Status Register B
.equ	UBRRL		= 0x09		; USART Baud Rate Register Low Byte
.equ	ACSR		= 0x08		; Analog Comparator Control And Status Register
.equ	ADMUX		= 0x07		; The ADC multiplexer Selection Register
.equ	ADCSRA		= 0x06		; The ADC Control and Status register
.equ	ADC		= 0x04		; ADC Data Register  Bytes
.equ	TWDR		= 0x03		; TWI Data register
.equ	TWAR		= 0x02		; TWI (Slave) Address register
.equ	TWSR		= 0x01		; TWI Status Register
.equ	TWBR		= 0x00		; TWI Bit Rate register


; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SFIOR bits		------------------------
.equ	ACME		= 3		; 0x08 - Analog Comparator Multiplexer Enable

; ----------	Register ACSR bits		------------------------
.equ	ACD		= 7		; 0x80 - Analog Comparator Disable
.equ	ACBG		= 6		; 0x40 - Analog Comparator Bandgap Select
.equ	ACO		= 5		; 0x20 - Analog Compare Output
.equ	ACI		= 4		; 0x10 - Analog Comparator Interrupt Flag
.equ	ACIE		= 3		; 0x08 - Analog Comparator Interrupt Enable
.equ	ACIC		= 2		; 0x04 - Analog Comparator Input Capture Enable
.equ	ACIS_MASK	= 0x03		;      - Analog Comparator Interrupt Mode Select bits (2 bits)
.equ	ACIS0		= 0		;          ACIS BIT0 position
; ::::  ACIS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x01		; Reserved
;			0x02		; Interrupt on Falling Edge
;			0x03		; Interrupt on Rising Edge



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit

; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	>>>> This is a part of COMM_SCK_RATE_3BIT enum (see complete values list below)



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register GICR bits		------------------------
.equ	INT_MASK	= 0xC0		;      - External Interrupt Request 1 Enable (2 bits)
.equ	INT0		= 6		;          INT BIT0 position
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

