sterentev/atdf-device-asm-include/inc/ATmega8A.inc
; ----------	Register SPMCR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read-While-Write Section Busy
.equ	RWWSRE		= 4		; 0x10 - Read-While-Write Section Read Enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable

; ----------	Register SFIOR bits		------------------------
.equ	ADHSM		= 4		; 0x10 - ADC High Speed Mode
.equ	PUD		= 2		; 0x04 - Pull-up Disable
.equ	PSR10		= 0		; 0x01 - Prescaler Reset Timer/Counter1 and Timer/Counter0



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - Left Adjust Result
.equ	MUX_MASK	= 0x0F		;      - Analog Channel and Gain Selection Bits (4 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal Vref turned off
;			0x40		; AVCC with external capacitor at AREF pin
;			0x80		; Reserved
;			0xC0		; Internal 2.56V Voltage Reference with external capacitor at AREF pin

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADFR		= 5		; 0x20 - ADC  Free Running Select
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC  Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position
; ::::  ADPS	:::: bitfield values
;			0x00		; 2
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64
; ::::  CLK_SEL_3BIT_EXT	:::: values
;			0b000		; No Clock Source (Stopped)
;			0b001		; Running, No Prescaling
;			0b010		; Running, CLK/8
;			0b011		; Running, CLK/64
;			0b100		; Running, CLK/256
;			0b101		; Running, CLK/1024
;			0b110		; Running, ExtClk Tn Falling Edge
;			0b111		; Running, ExtClk Tn Rising Edge
; ::::  WAVEFORM_GEN_MODE	:::: values
;			0b00		; Normal
;			0b10		; PWM, Phase Correct
;			0b01		; CTC
;			0b11		; Fast PWM



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 19
.equ	INT_VECTORS_SIZE	= 0x26
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	TIMER2_COMP	; Timer/Counter2 Compare Match
;	4	TIMER2_OVF	; Timer/Counter2 Overflow
;	5	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	6	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	7	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	8	TIMER1_OVF	; Timer/Counter1 Overflow
;	9	TIMER0_OVF	; Timer/Counter0 Overflow
;	10	SPI_STC		; Serial Transfer Complete
;	11	USART_RXC	; USART, Rx Complete
;	12	USART_UDRE	; USART Data Register Empty
;	13	USART_TXC	; USART, Tx Complete
;	14	ADC		; ADC Conversion Complete
;	15	EE_RDY		; EEPROM Ready
;	16	ANA_COMP	; Analog Comparator
;	17	TWI		; 2-wire Serial Interface
;	18	SPM_RDY		; Store Program Memory Ready



; **********************************************************************
; ***************	ASM PROGRAM SKELETON	************************
; **********************************************************************
;
;  Copy-paste following definitions into your code,
;  uncomment and modify for your needs
;
; ----------	 >>>   SKELETON BEGIN   <<<	------------------------
;#	.include "ATmega8A.inc"
;#	
;#	; FUSES HIGH byte (addr 0x01)
;#	.set	BOOTSZ		= 0x02	; Boot Flash size=512 words Boot address=$0E00
;#	.set	FUSES_HIGH	= 0xFF \
;#				  & ~(0 <<RSTDISBL) \
;#				  & ~(0 <<WDTON) \
;#				  & ~(1 <<SPIEN) \
;#				  & ~(0 <<EESAVE) \
;#				  &  (~BOOTSZ_MASK | BOOTSZ) \
;#				  & ~(0 <<BOOTRST) \
;#				  & ~(0 <<CKOPT)
;#	; FUSES LOW byte (addr 0x00)
;#	.set	SUT_CKSEL	= 0x21	; Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms; default value
;#	.set	FUSES_LOW	= 0xFF \
;#				  & ~(0 <<BODLEVEL) \
;#				  & ~(0 <<BODEN) \
;#				  &  (~SUT_CKSEL_MASK | SUT_CKSEL)
;#	; LOCKBITS LOCKBIT byte (addr 0x00)
;#	.set	LB		= 0x03	; No memory lock features enabled
;#	.set	BLB0		= 0x0C	; No lock on SPM and LPM in Application Section
;#	.set	BLB1		= 0x30	; No lock on SPM and LPM in Boot Section
;#	.set	LOCKBITS_LOCKBIT= 0xFF \
;#				  &  (~LB_MASK | LB) \
;#				  &  (~BLB0_MASK | BLB0) \
;#				  &  (~BLB1_MASK | BLB1)
;#	.message "====================="
;#	.message "=====  Fuses  ======="
;#	.message "HIGH		", FUSES_HIGH
;#	.message "LOW		", FUSES_LOW
;#	.message "===== Lockbits ======"
;#	.message " LOCKBIT	", LOCKBITS_LOCKBIT
;#	.message "====================="
;#	
;#	.org 0x0000
;#	; Interrupt vectors begin
;#		rjmp	RESET		; RESET		 - External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset
;#		rjmp	INT0_ISR	; INT0		 - External Interrupt Request 0
;#		reti			; INT1		 - External Interrupt Request 1
;#		reti			; TIMER2_COMP	 - Timer/Counter2 Compare Match
;#		reti			; TIMER2_OVF	 - Timer/Counter2 Overflow
;#		reti			; TIMER1_CAPT	 - Timer/Counter1 Capture Event
;#		reti			; TIMER1_COMPA	 - Timer/Counter1 Compare Match A
;#		reti			; TIMER1_COMPB	 - Timer/Counter1 Compare Match B
;#		reti			; TIMER1_OVF	 - Timer/Counter1 Overflow
;#		reti			; TIMER0_OVF	 - Timer/Counter0 Overflow
;#		reti			; SPI_STC	 - Serial Transfer Complete
;#		reti			; USART_RXC	 - USART, Rx Complete
;#		reti			; USART_UDRE	 - USART Data Register Empty
;#		reti			; USART_TXC	 - USART, Tx Complete
;#		reti			; ADC		 - ADC Conversion Complete
;#		rjmp	EE_RDY_ISR	; EE_RDY	 - EEPROM Ready
;#		reti			; ANA_COMP	 - Analog Comparator
;#		reti			; TWI		 - 2-wire Serial Interface
;#		reti			; SPM_RDY	 - Store Program Memory Ready
;#	; Interrupt vectors end
;#	;.org INT_VECTORS_SIZE
;#	RESET:
;#		cli
;#		ldi	r16, high(ADDR_IRAM_END)
;#		out	SP+1, r16
;#		ldi	r16, low(ADDR_IRAM_END)
;#		out	SP, r16
; ----------	 >>>   SKELETON  END    <<<	------------------------

#endif /* _ATMEGA8A_INC_ */

; ************************ END OF FILE *********************************

